{
    "title": "MDMA and Supplements",
    "pages": [
        ["Antioxidants and Magnesium", "**Antioxidants** are the most effective supplements for reducing neurotoxic effects from MDMA. [Acetyl-L-carnitine](https://www.ncbi.nlm.nih.gov/pubmed/19015003) and [alpha-lipoic acid](https://www.ncbi.nlm.nih.gov/pubmed/10619665) show promising neuroprotective effects in rats, as well as [strong synergy of effects when taken together.](https://www.ncbi.nlm.nih.gov/pubmed/20414966) Emergen-C packets (vitamin C drink mix) are another great method of supplementing antioxidants as vitamin C has been [shown to protect against neurotoxic effects in rats,](https://www.ncbi.nlm.nih.gov/pubmed/11170222) and the drink mix is a good way to kill two birds with one stone and stay hydrated\n\n**Magnesium** is a common supplement to take with MDMA and other stimulants. It relieves muscle tension, and can help prevent jaw clenching, as well as [some degree of neuroprotection.](https://www.sciencedirect.com/science/article/abs/pii/S1044576584710128) There are several formulations commonly available [with varying degrees of efficacy](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6683096/). If possible, find formulations with chelated magnesium (magnesium glycinate/diglycinate, magnesium citrate, magnesium taurate etc.) and avoid forms such as magnesium oxide or magnesium chloride. Additionally, make sure to preload (take regular doses for several days before rolling) magnesium, as your body is limited in the amount it can absorb in one dose"],
        ["A Word of Caution", "While many supplements show extremely promising results in studies on MDMA neurotoxicity in rats, it is important to remember that some of these supplements have limited scientific review - especially when used in combination with others, potentially leading to very complex interactions. This just goes to say, while properly using supplements shows promise as effective harm reduction, they are not a silver bullet for eliminating adverse effects. They are most effective when following ALL tenets of harm reduction, and **should never be your first line of defense.**\n\n**Ideal Stack:**\nAlpha-lipoic acid\nAcetyl-l-carnitine\nMagnesium\nVitamin C\nElectrolytic fluids\nAlpha-lipoic acid\nAcetyl-l-carnitine\nMagnesium\n\n**Minimal Stack:**\nAlpha-lipoic acid\nAcetyl-l-carnitine\nMagnesium"],
        ["Overwhelmed?", "You are not alone. If you want to avoid complex dose schedules with many different supplements, just take ALA and ALCAR. They are the most effective at preventing neurotoxic effects, especially when taken together. If jaw clenching is an issue for you, add magnesium.\n\nFor more on beneficial supplements & reputable sources, use command ``.supps`` or visit [rollsafe.org](https://rollsafe.org/mdma-supplements/)\n\n**Disclaimer:**The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements."]
    ]
}