{
    "aliases": ["molly", "rollsafe", "mdmahr"],
    "title": "MDMA Harm Reduction",
    "pages": [
        ["Overheating and Hydration", "MDMA disrupts natural regulation of your body's temperature, and [neurotoxic effects are much stronger when ambient temperatures are high.](https://www.ncbi.nlm.nih.gov/pubmed/15245478) **Avoid hot environments, and take frequent breaks from physical activity when rolling!**\n\n     Hydration is vital to enjoying MDMA safely. Dehydration can be a serious health risk (especially in environments such as raves or clubs), however [excessive water consumption can also lead to severe medical complications](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4923534/) (especially in women). **If you are dancing, or in a hot environment, drink ~2 glasses/500ml per hour. If not, drink no more than ~1 glass/250ml per hour.** Also, drinks containing electrolytes (Gatorade etc.) are much more effective for maintaining hydration. If you only have water, eat lots of salty snacks too!"],
        ["Drug Interactions", "Several prescription medications and recreational drugs can be fatal when combined with MDMA. **Absolutely never mix MDMA with any MAOIs (B.Caapi, Syrian rue etc. or Rx such as Nardil, Parnate or Marplan) and wait at least three weeks after taking one to take MDMA.** Many compounds interact with the enzymes that metabolize MDMA and should be avoided when taking MDMA - these compounds include but are not limited to: **DXM, Codeine, many SSRIs and St. John's wort.** Care should be taken to avoid combining MDMA with drugs that increase stress on the cardiovascular system; **cocaine, amphetamine, alcohol and/or other sedatives/CNS depressants**. If you are concerned about neurotoxic effects, avoid taking classical psychedelics such as LSD, 2C-B and/or mushrooms with MDMA as they have been [shown to increase neurotoxicity in rats.](https://onlinelibrary.wiley.com/doi/abs/10.1002/nrc.20023)"],
        ["Dosage", "[Studies have shown](https://www.ncbi.nlm.nih.gov/pubmed/21993879) that desirable effects are maximized generally between ~80-140mg whilst adverse effects greatly increase after ~180mg. Standard guidelines advise no more than ~1.5mg/kg with 120mg max, or your weight in kg + 50 as general best practice. **Never exceed 200mg when rolling.**"],
        ["Test Kits and Supplements", "Reagent test kits are the only way to reliably identify drugs/adulterants and **are absolutely mandatory** when using MDMA. Use commands ``.reagents`` or ``.testmdma`` for more information.\n\nSeveral common supplements can be beneficial when using MDMA. Use command ``.mdmasupps`` for more information."]
    ]
}