{
    "aliases": ["firsttrip"],
    "title": "First Trip Preparation",
    "pages": [
        ["Contraindications", "First things first, there are several conditions and medications that could pose potential risk or otherwise adverse effects when using psychedelics. These include, but are not limited to;\n\nCurrent or past history of schizoid, psychotic or bipolar disorders - either yourself or a first or second degree relative\n\nHigh blood pressure, or pregnancy\n\nExtreme caution must be used to try psychedelics whilst using tricyclics, lithium, SSRIs, haloperidol or MAOIs\n\nExercise extreme caution using psychedelics with serotonergic supplements like 5-HTP, St. Johns wort etc.\n\nAvoid using cannabis for at least 12-24 hours before taking your first psychedelic"],
        ["Safety", "You should **always** test your drugs before you consume them. The Ehrlich reagent will help identify LSD and mushrooms and rule out potentially fatal adulterants. For more information, use command ``.testlsd`` or ``.reagents``\nIn addition to this, mushrooms are often recommended as a good introductory psychedelic over LSD given its shorter duration, and lower risk of dangerous adulterants."],
        ["Dosage", "Opinions on the matter of dosage for your first trip may vary depending on how you ask. However, [research has shown](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3308357/) that starting with small doses and increasing over time with subsequent sessions generally produced greater persisting positive effects. Consider starting with no more than **1-1.5 grams of dried cubensis, or 80-100ug of LSD.** However, bear in mind that mushrooms can naturally significantly vary in potency, and tabs of LSD are often inaccurately dosed. It's always better to be safe than sorry, so dose conservatively - there is always next time to go deeper. Also, re-assessing dosage and starting low when using drugs from a new source is highly recommended, regardless of prior experience."],
        ["Tripsitter", "A tripsitter is a trusted, sober friend who can help ease you into the psychedelic experience. **It is strongly recommended to have one for your first few trips** as a protective measure for both your mental and physical health. A good tripsitter most often has prior experience with the drug you intend to take and its effects, as having a sitter who is not familiar with altered states of consciousness can lead to unpleasant experiences, even if they are a close friend. However, the most vital quality of a good tripsitter is your measure of trust in them. Psychedelic experiences can put you in an extremely vulnerable state of mind, so **it is important that you are comfortable expressing all thoughts and aspects of yourself to your sitter**. Ideally, a good sitter should also be someone you are comfortable sitting in silence with. For more information, your sitter should read [this guide](https://tripsafe.org/psychedelic-trip-sitter-guide/) on tripsitting preparation."],
        ["Set", "Your set, or mindset, is easily one of the most important factors in ensuring a positive first experience with psychedelics. One of the most challenging aspects of a psychedelic experience is that of giving up control - those with excessive intial apprehension of the experience, rigid defense structures or considerable subsurface guilt or conflict are more likely to resist the experience, which can result in an unpleasant trip. It is recommended to be in a generally good mood both on the day you choose to trip, and for the few weeks prior to it."],
        ["Setting", "The setting for your first trip should be one you are intimately familiar with, safe and private. Generally, a house is the best place for your first trip; it can be cleaned prior to the experience (clutter and dirt can be uncomfortable), it is a controlled environment (unexpected things can be hard to deal with on psyches) and generally much safer than outdoors or in public. It is a good idea to prepare your house for your trip - as stated, cleaning can both be beneficial as a pre-trip ritual to prepare your mind, as well as avoid any potential stressors. Preparation of media or activities to enjoy when tripping is also recommended - visual documentaries, art supplies, light toys or a playlist of your favorite music are all good ideas. Eyeshades and headphones are also recommended. In addition to phyiscal aspects of your setting, you should also ensure that your schedule is free of responsibility for up to two or three days after you trip."],
        ["More Tips", "It is not recommended to smoke weed on your first trip, however if you insist, wait at least two hours after dropping, and allow 15-20 minutes between hits to adjust to the increased effects\n\nPhones can be distracting - consider giving yours to your sitter\n\nA good night of rest will do you well on either side of the trip - aim for 8 hours\n\nEat a healthy meal a few hours before dropping - psyches suppress appetite but you don't want to be running on fumes. You can also try some light, healthy snacks like fruit or nuts to eat on the trip\n\nTake time to properly integrate your trip before taking psychedelics again - it can take more than a month\n\nConsider getting some ginger to help alleviate any nausea\n\nWriting your dose and the time you took it on your hand in washable marker can help escape thought loops/a bad trip"]
    ]
}