{
    "aliases": ["testkits", "reagentkits", "test", "kits"],
    "title": "Drug Testing at Home",
    "pages": [
        ["Reagent Test Kits", "Reagent testing kits are **the only way** users can screen for adulterants in their drugs. **They are the first step in practicing proper harm reduction!** While the upfront cost of a kit may be somewhat prohibitive to many users, they will often contain enough reagent for many uses and are cheap when considering the lethality of many adulterants found in drugs worldwide. When using reagents, it is also important to remember they test for **presence, not purity.** While infinitely better than the alternative of not testing at all, reagents are not perfect and can be fooled. **When in doubt, throw it out.**\n\n**NA Vendors:**\n[dancesafe.org](https://dancesafe.org)\n[bunkpolice.com](https://bunkpolice.com)\n\n**EU Vendors:**\n[reagent-tests.uk](https://reagent-tests.uk)\n[sin.org.pl](https://sin.org.pl)"],
        ["Storage and Handling", "Many reagents are caustic and can cause severe irritation or damage to skin and eyes. Wear latex gloves when handling reagent bottles, and if you get some on you, wash quickly with soap and water. Wash testing surfaces before and after use. Dispose of unwanted reagents down the sink with running water and baking soda. Store all kits in a cold, dark place such as a refrigerator between uses.\n\n**1.** Scrape a tiny amount of your pill or powder onto a large, white ceramic plate. Use just enough powder to see on the plate\n**2.** Carefully remove the cap and set aside - ideally upside down to avoid cross-contamination\n**3.** Squeeze one drop from the bottle onto the powder\n**4.** Pay close attention to the color change (or lack thereof) and refer to your color chart (or use [the BunkPolice Spectrum booklets.](https://bunkpolice.com/spectrum-booklets/))\n**5.** Replace the cap on your reagent, taking care to avoid cross-contamination.\n\nIdeally you should use more than one reagent for increased testing accuracy. If you are, only unscrew one cap at a time to avoid cross-contamination"]
    ]
}
