{
    "aliases": ["scale"],
    "title": "Scales",
    "pages": [
        ["About Scales", "Scales are vital to safe drug use, especially when using drugs in powder form. Estimating doses can be exceptionally inaccurate as density often varies significantly. Scales are rated by their max load and the smallest unit they measure - a milligram scale that can weigh up to 20g is a 20x0.001g scale. Milligram scales are ideal for use in measuring most drugs, 0.01g scales work for scaling substances dosed in several grams, but **should not be used for scaling anything under a gram!** Do not buy 0.1g scales as they are not accurate for 99% of drugs, and the price difference in between one and a 0.01g scale is usually negligible.\n\nJust because a scale measures milligrams, it does not mean it is accurate to the exact milligram. **Anything dosed under 10-15mg, or where variance of ±10mg could be dangerous should be scaled volumetrically** - use command ``.volumetric`` for more information\n\n**Recommended Scales:**\n[AWS Gemini 20 - 20x0.001g](https://www.amazon.com/American-Weigh-GEMINI-20-Portable-MilliGram/dp/B0012TDNAM/)\n[WAOAW Digital Scale - 50x0.001g](https://www.amazon.com/dp/B06W5VXN53)\n[Smart Weigh GEM20 - 20x0.001g](https://www.amazon.com/dp/B00ESHDGOI)"],
        ["Best Techniques", "Most scales come with a calibration weight - **use it.** Calibration will be off from the factory. You should calibrate your scale somewhat frequently, and especially if you take it somewhere. Instructions should come in the manual for your scale. You should also TARE your scale using the calibration weight when you are trying to weigh something - scales are most accurate at their midpoint (halfway to their max weight - i.e 10g for a 20x0.001g scale). Incidentally, many calibration weights happen to weigh exactly half of the max. You should also use the scale cover when weighing your sample, as moving air can throw off the reading. Finally, you should scale your sample multiple times and take the average weight as they will probably differ to get the best idea of the sample's weight."]
    ]
}
