{
"mdmasupps": {
    "title": "MDMA and Supplements",
    "fields": [
        ["Antioxidants", "Antioxidants are the most effective supplements for reducing neurotoxic effects from MDMA. [Acetyl-L-carnitine](https://www.ncbi.nlm.nih.gov/pubmed/19015003) and [alpha-lipoic acid](https://www.ncbi.nlm.nih.gov/pubmed/10619665) show promising neuroprotective effects in rats, as well as [strong synergy of effects when taken together.](https://www.ncbi.nlm.nih.gov/pubmed/20414966) Emergen-C packets (vitamin C drink mix) are another great method of supplementing antioxidants as vitamin C has been [shown to protect against neurotoxic effects in rats,](https://www.ncbi.nlm.nih.gov/pubmed/11170222) and the drink mix is a good way to kill two birds with one stone and stay hydrated", "False"],
        ["Magnesium", "Magnesium is a common supplement to take with MDMA and other stimulants. It relieves muscle tension, and can help prevent jaw clenching, as well as [some degree of neuroprotection.](https://www.sciencedirect.com/science/article/abs/pii/S1044576584710128) There are several formulations commonly available [with varying degrees of efficacy](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6683096/). If possible, find formulations with chelated magnesium (magnesium glycinate/diglycinate, magnesium citrate, magnesium taurate etc.) and avoid forms such as magnesium oxide or magnesium chloride. Additionally, make sure to preload (take regular doses for several days before rolling) magnesium, as your body is limited in the amount it can absorb in one dose", "False"],
        ["A Word of Caution", "While many supplements show extremely promising results in studies on MDMA neurotoxicity in rats, it is important to remember that some of these supplements have limited scientific review - especially when used in combination with others, potentially leading to very complex interactions. This just goes to say, while properly using supplements shows promise as effective harm reduction, they are not a silver bullet for eliminating adverse effects. They are most effective when following ALL tenets of harm reduction, and **should never be your first line of defense.**", "False"],
        ["Ideal Stack", "Alpha-lipoic acid\nAcetyl-l-carnitine\nMagnesium\nVitamin C\nElectrolytic fluids\nAlpha-lipoic acid\nAcetyl-l-carnitine\nMagnesium", "True"],
        ["Minimal Stack", "Alpha-lipoic acid\nAcetyl-l-carnitine\nMagnesium", "True"],
        ["Overwhelmed?", "You are not alone. If you want to avoid complex dose schedules with many different supplements, just take ALA and ALCAR. They are the most effective at preventing neurotoxic effects, especially when taken together. If jaw clenching is an issue for you, add magnesium.", "False"],
        ["More Information", "For more on beneficial supplements & reputable sources, use command ``.supps`` or visit [rollsafe.org](https://rollsafe.org/mdma-supplements/)", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
},
"supps": {
    "title": "Beneficial Supplements",
    "fields": [
        ["Antioxidants", "Extremely effective at preventing oxidative neurotoxicity; ranked by importance from most to least.\n\n``.ala``\n``.alcar``\n``.vitc``", "True"],
        ["Miscellaneous", "Various supplements show benefit in reducing various adverse effects from MDMA and other stimulants; ranked by importance from most to least.\n\n``.magnesium``\n``.hydration``\n``.ginger``\n``.5htp`` **- Caution**", "True"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
},
"ala": {
    "title": "Alpha-Lipoic Acid",
    "fields": [
        ["A Powerful Antioxidant", "ALA is probably the [single most effective neuroprotective supplement you can buy for MDMA.](https://www.ncbi.nlm.nih.gov/pubmed/10619665) Use with acetyl-l-carnitine for best results (use command ``.alcar`` for more information).", "False"],
        ["Recommended Dose Schedule", "300mg with MDMA, then every 1-2 hours after that until 7 hours post dose (total of 1,200-2,400mg)\n**Do not consume more than 2,400mg in a day**", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
},
"alcar": {
    "title": "Acetyl-l-carnitine",
    "fields": [
        ["A Powerful Antioxidant", "After ALA, ALCAR is probably the [next most effective supplement for mitigating neurotoxic effects from MDMA.](https://www.ncbi.nlm.nih.gov/pubmed/19015003) Use with alpha-lipoic acid for best results (use command ``.ala`` for more information)", "False"],
        ["Recommended Dose Schedule", "500mg 3hr before MDMA, 1hr after MDMA and 5hr after MDMA (total of 1,500mg)\n**Do not consume more than 2,500mg in a day**", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
},
"vitc": {
    "title": "Vitamin C",
    "fields": [
        ["A Powerful Antioxidant", "Vitamin C is a great supplement to add to any roll stack as it is common and cheap. [It shows promise as a neuroprotective agent when taken with MDMA.](https://www.ncbi.nlm.nih.gov/pubmed/11170222) Preferred formulations include chewables (as swallowing tablets may be difficult on MDMA) and Emergen-C drink mixes (killing two birds with one stone and staying hydrated)", "False"],
        ["Recommended Dose Schedule", "500mg every three hours, starting ~3 hours before taking MDMA and finishing 6-7 hours afterwards (total of 2,000mg) Higher doses of vitamin C (2,000-6,000mg) [may cause gastrointestinal problems.](https://examine.com/supplements/vitamin-c/) If you know you can take more vitamin C without GI issues, consider taking 250-500mg every ~1-2 hours instead, as smaller but more frequent doses may be more effective", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
},
"magnesium": {
    "title": "Magnesium",
    "fields": [
        ["Muscle Relief and Neuroprotection", "Magnesium is a common supplement for relieving muscle tension and will help alleviate jaw clenching. In addition to this, [it may help prevent MDMA induced neurotoxicity](https://www.sciencedirect.com/science/article/abs/pii/S1044576584710128). Several forms are available [with varying degrees of efficacy.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6683096/) Chelated forms, such as magnesium glycinate/biglycinate, magnesium citrate and magnesium taurate are much more effective than common forms such as magnesium oxide and magnesium chloride (avoid these).", "False"],
        ["What is Chelated Magnesium?", "Magnesium is a substance that readily binds to insoluble salts in the stomach and intestines. This makes it hard to absorb in elemental form (or in forms like magnesium oxide or chloride) By binding magnesium to soluble amino acids like glycine or taurine prevents binding to the insoluble salts and massively increases bioavailability.", "False"],
        ["Recommended Dose Schedule", "100-200mg elemental magnesium twice daily for 2-3 days before taking MDMA, 100-200mg elemental magnesium 2 hours before MDMA, taken with MDMA and 2-4 hours after", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
},
"hydration": {
    "title": "Hydration",
    "fields": [
        ["Hydration and Salinity", "Hydration is absolutely vital to enjoying many drugs safely and responsibly. However, in the context of using MDMA safely, hydration is also in a balancing act with blood salinity (sodium content). [Excessive water consumption can lead to severe medical complications](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4923534/) - an effect which is more pronounced in women than men. Guidelines recommend **1-2 glasses (250-500ml) of water per hour when rolling if dancing/other physical activity, and no more than 1 glass (250ml) per hour if relaxing** to avoid possible overhydration. [MDMA impairs response to water intake](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4923534/) by both lowering absorption and clearance, so it is important to stay mindful of your water intake.", "False"],
        ["Electrolytes and Isotonic Solutions", "Staying hydrated using fluids filled with electrolytes (like Gatorade) or isotonic fluids with sodium are much preferred to simply hydrating with water", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
},
"ginger": {
    "title": "Ginger",
    "fields": [
        ["Antiemetic and Antioxidant", "Ginger is a common supplement revered for [its antiemetic/anti-nausea effects](https://examine.com/supplements/ginger/) however it may [also help with neuroprotection](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3584433/) when rolling. Ginger comes in many forms; extracts, chews, candies, liquid extracts or the rhizome/root itself", "False"],
        ["Dosage Guidelines", "Different ginger products contain different amounts of ginger so dosage will vary, but generally the equivalent of 1-2g fresh grated ginger 4 hours before MDMA/other drugs, 1 hour before and as needed afterwards should be effective at reducing nausea and come with the added benefit of neuroprotection.", "False"],
        ["An Important Note", "When using ginger with MDMA, it is extremely important to keep track of your fluid consumption and limit to 500ml/hr total as nausea is a potential symptom of hyponatremia/low blood salinity due to overhydration (which can be fatal). This is especially important if you are only drinking water and not isotonic fluids containing electrolytes", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
},
"5htp": {
    "title": "5-HTP",
    "fields": [
        ["A Last Resort", "5-HTP is a supplement that is vastly misunderstood. [5-HTP is the chemical your body uses to produce serotonin.](https://www.ncbi.nlm.nih.gov/pubmed/9727088) While MDMA causes detrimental depletion of serotonin, there are many risks associated with 5-HTP. First, [it has produced neurotoxic effects.](https://www.ncbi.nlm.nih.gov/pubmed/31349924) Furthermore, 5-HTP also increases serotonin levels in your body/peripheral nervous system [which is linked to cardiovascular disease.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1850922/) Finally, long-term administration of 5-HTP alone [depletes other neurotransmitters](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3415362/) like dopamine and norepinephrine. The processes that synthesize and control levels of neurotransmitters are finely tuned biological machines, and messing with them with something like 5-HTP often has a domino effect on many other important processes. This depletion is both unhealthy and directly aggravates related disorders.", "False"],
        ["The Bottom Line", "The use of 5-HTP should be avoided if at all possible. While it may seem enticing as something to reduce the comedown, there are a myriad of risks that come along with its use. **5-HTP must never be taken within 24 hours of MDMA** as it can result in dangerously high levels of serotonin. There is [limited evidence](https://www.ncbi.nlm.nih.gov/pubmed/12759801) that use of a precursor to 5-HTP may be beneficial for memory-related tasks in people who have abused MDMA in the past - if you are following less safe practices (frequent use, high doses etc.) it *may* be beneficial to supplement for at most a week after using MDMA, starting the night after your MDMA session. If you are taking 5-HTP, you should be taking green tea catechins (EGCG/EGC) to prevent peripheral metabolism of 5-HTP to serotonin before it crosses your BBB.", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
}
}