{
    "aliases": ["5-htp"],
    "title": "5-HTP",
    "fields": [
        ["A Last Resort", "5-HTP is a supplement that is vastly misunderstood. [5-HTP is the chemical your body uses to produce serotonin.](https://www.ncbi.nlm.nih.gov/pubmed/9727088) While MDMA causes detrimental depletion of serotonin, there are many risks associated with 5-HTP. First, [it has produced neurotoxic effects.](https://www.ncbi.nlm.nih.gov/pubmed/31349924) Furthermore, 5-HTP also increases serotonin levels in your body/peripheral nervous system [which is linked to cardiovascular disease.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1850922/) Finally, long-term administration of 5-HTP alone [depletes other neurotransmitters](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3415362/) like dopamine and norepinephrine. The processes that synthesize and control levels of neurotransmitters are finely tuned biological machines, and messing with them with something like 5-HTP often has a domino effect on many other important processes. This depletion is both unhealthy and directly aggravates related disorders.", "False"],
        ["The Bottom Line", "The use of 5-HTP should be avoided if at all possible. While it may seem enticing as something to reduce the comedown, there are a myriad of risks that come along with its use. **5-HTP must never be taken within 24 hours of MDMA** as it can result in dangerously high levels of serotonin. There is [limited evidence](https://www.ncbi.nlm.nih.gov/pubmed/12759801) that use of a precursor to 5-HTP may be beneficial for memory-related tasks in people who have abused MDMA in the past - if you are following less safe practices (frequent use, high doses etc.) it *may* be beneficial to supplement for at most a week after using MDMA, starting the night after your MDMA session. If you are taking 5-HTP, you should be taking green tea catechins (EGCG/EGC) to prevent peripheral metabolism of 5-HTP to serotonin before it crosses your BBB.", "False"],
        ["Disclaimer", "The information provided is only a means to raise awareness and should not be construed as medical advice. Always consult with your doctor before taking supplements.", "False"]
    ]
}